### Missing Values

In [2]:
import pandas as pd
import numpy as np

In [ ]:
df = pd.r

In [3]:
dict1 = {"names":["Arvind","samar",np.nan,"siri"],
"Age":[np.nan,21,32,43],
"city":["Hyd","ble","chenai",np.nan]}

dict1

{'names': ['Arvind', 'samar', nan, 'siri'],
 'Age': [nan, 21, 32, 43],
 'city': ['Hyd', 'ble', 'chenai', nan]}

In [4]:
pd.DataFrame(dict1)

    names   Age    city
0  Arvind   NaN     Hyd
1   samar  21.0     ble
2     NaN  32.0  chenai
3    siri  43.0     NaN

In [5]:
d1 = pd.DataFrame(dict1)

In [7]:
d1.dtypes

names     object
Age      float64
city      object
dtype: object

In [12]:
dict2 = {"names":["Arvind","samar",None,"siri"],
"Age":[np.nan,21,32,43],
"city":["Hyd","ble","chenai",None]}

dict2

{'names': ['Arvind', 'samar', None, 'siri'],
 'Age': [nan, 21, 32, 43],
 'city': ['Hyd', 'ble', 'chenai', None]}

In [11]:
d2 = pd.DataFrame(dict2)
d2

    names   Age    city
0  Arvind   NaN     Hyd
1   samar  21.0     ble
2    None  32.0  chenai
3    siri  43.0    None

In [13]:
d1.isnull()

   names    Age   city
0  False   True  False
1  False  False  False
2   True  False  False
3  False  False   True

In [14]:
d1.isnull().sum()

names    1
Age      1
city     1
dtype: int64

np.nan : noa number this is aplicable for numerical columns only

-  Gennerally data has some empty rows
- it is adata problem
- if you read that that of data you will see null
- you need to understand it is a data corrupted or really null values

### Methord -1
 - fill with some randomm values
 - methord name also

In [16]:
d1.isnull().sum()*100/len(d1)

names    25.0
Age      25.0
city     25.0
dtype: float64

In [17]:
d1.fillna(40)

    names   Age    city
0  Arvind  40.0     Hyd
1   samar  21.0     ble
2      40  32.0  chenai
3    siri  43.0      40

#### Methord -2
 
- we can fill the vlaues with respect to columns also

In [20]:
d1["Age"].fillna(40,inplace=True)

In [21]:
d1

    names   Age    city
0  Arvind  40.0     Hyd
1   samar  21.0     ble
2     NaN  32.0  chenai
3    siri  43.0     NaN

In [22]:
d1["names"].fillna("sandy",inplace=True)

In [23]:
d1

    names   Age    city
0  Arvind  40.0     Hyd
1   samar  21.0     ble
2   sandy  32.0  chenai
3    siri  43.0     NaN

#### Methods -3

- bfill
- ffill
- pad
- backfill


- columns1: name sindex 3 is missinmg vales it is filled with index 4 values

- column2 : age index 1 missing value it is filled with next value index 2

-  column3: citry index 4 is missing value it should be fill with next value but we dont have nect vale

In [26]:
d2.fillna(method="bfill")

    names   Age    city
0  Arvind  21.0     Hyd
1   samar  21.0     ble
2    siri  32.0  chenai
3    siri  43.0    None

In [29]:
d2.fillna(method="ffill",axis=1)
## axix 1 mean columns so the nan values will fill with next columns values

    names     Age    city
0  Arvind  Arvind     Hyd
1   samar    21.0     ble
2    None    32.0  chenai
3    siri    43.0    43.0

In [32]:
d2.fillna(method="pad",axis=1)

    names     Age    city
0  Arvind  Arvind     Hyd
1   samar    21.0     ble
2    None    32.0  chenai
3    siri    43.0    43.0

-  backfill and bifill filled with with next vale
- pad and ffill filled with previous value
- but will change based on axix

#### Methord - 4
   - mean
      - numerical values can fill with mean values
      - but mean affect by outlairs
      -  if dont have outlairs its the best one
     
   - median
      - numerical values can fill with mean values
      - median value dosenot affect with outlairs
      - if outlairs with there we can use median

   - mode
      - mode is usefull for catagorical data

In [33]:
d2

    names   Age    city
0  Arvind   NaN     Hyd
1   samar  21.0     ble
2    None  32.0  chenai
3    siri  43.0    None

In [34]:
# we already know we can fills with values specifc columns using fill na
# d2.fillna(<randon_number)4
# d1 represnt all columns 
age_mean = d2["Age"].mean()
d2["Age"].fillna(age_mean)

0    32.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [36]:
median =  d2["Age"].median()
d2["Age"].fillna(median)

0    32.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [39]:
mode =  d2["city"].mode()
d2["city"].fillna(mode)


# in this case we are getting mode equal
# but in most case we will

0       Hyd
1       ble
2    chenai
3       NaN
Name: city, dtype: object

-  fill with random values
- fill with random value on splecif values'
-  fill with methods        
    - bfill
    - ffill
    - pad
    - backfill

- fill with
    - mean
    - median
    - mode

### Method -5

##### KNN imuter 

- KNN means k nearsent Neighbours
- k is a hyperparameter use can choose 
- its a distance matrix called uclidian distance
- KNN imputer will take the mean of nighbour value , nighbour value proided by k value
- its under sklean.imputer Knnimputer 
- aplicable for only numerical data

In [47]:
from sklearn.impute import KNNImputer
ki= KNNImputer()
ki.fit_transform([d2["Age"]])

array([[21., 32., 43.]])